In [2]:
import pandas as pd

In [5]:
Product = pd.read_csv('products.csv')
Sales = pd.read_csv('sales.csv')
Product.head()
Sales.head()

   sale_id product_id  units_sold  price_per_unit   sale_date
0     1001   PROD1058          10           18245  2024-09-25
1     1002   PROD1074           7           52726  2025-06-09
2     1003   PROD1062           4           38671  2024-08-20
3     1004   PROD1056           7           37118  2023-11-25
4     1005   PROD1011           8           68895  2023-12-29

In [6]:
Product.isnull().sum()

product_id      0
product_name    0
category        0
dtype: int64

In [7]:
Sales.isnull().sum()

sale_id           0
product_id        0
units_sold        0
price_per_unit    0
sale_date         0
dtype: int64

In [8]:
Product.describe

<bound method NDFrame.describe of    product_id product_name     category
0    PROD1001          The     Clothing
1    PROD1002     Actually     Clothing
2    PROD1003         Read     Clothing
3    PROD1004     Election         Toys
4    PROD1005     Somebody  Electronics
..        ...          ...          ...
95   PROD1096        Great  Electronics
96   PROD1097       Parent         Toys
97   PROD1098         Make     Clothing
98   PROD1099       Entire         Toys
99   PROD1100      Product  Electronics

[100 rows x 3 columns]>

In [9]:
Sales.describe

<bound method NDFrame.describe of      sale_id product_id  units_sold  price_per_unit   sale_date
0       1001   PROD1058          10           18245  2024-09-25
1       1002   PROD1074           7           52726  2025-06-09
2       1003   PROD1062           4           38671  2024-08-20
3       1004   PROD1056           7           37118  2023-11-25
4       1005   PROD1011           8           68895  2023-12-29
..       ...        ...         ...             ...         ...
995     1996   PROD1027           2           24859  2024-09-13
996     1997   PROD1079           6           10659  2025-06-08
997     1998   PROD1074           9           30980  2024-03-14
998     1999   PROD1043           3           20818  2023-11-26
999     2000   PROD1041           4            9361  2024-11-06

[1000 rows x 5 columns]>

In [11]:
Product.columns

Index(['product_id', 'product_name', 'category'], dtype='object')

In [12]:
Sales.columns

Index(['sale_id', 'product_id', 'units_sold', 'price_per_unit', 'sale_date'], dtype='object')

In [13]:
Sales.dtypes

sale_id            int64
product_id        object
units_sold         int64
price_per_unit     int64
sale_date         object
dtype: object

In [14]:
Sales['sale_date'] = pd.to_datetime(Sales['sale_date'])
Sales.dtypes

sale_id                    int64
product_id                object
units_sold                 int64
price_per_unit             int64
sale_date         datetime64[ns]
dtype: object

In [19]:
merged = pd.merge(Product, Sales, on= 'product_id', how= 'inner')
merged.to_csv("merged_prodsal.csv", index= False)

In [20]:
merged = pd.read_csv('merged_ProdSal.csv')
merged.head()

,product_id,product_name,category,sale_id,units_sold,price_per_unit,sale_date
0,PROD1001,The,Clothing,1030,9,36440,2024-04-18
1,PROD1001,The,Clothing,1032,4,3525,2024-03-20
2,PROD1001,The,Clothing,1207,8,61821,2025-01-23
3,PROD1001,The,Clothing,1213,4,5257,2024-06-09
4,PROD1001,The,Clothing,1262,7,65599,2024-04-01

In [22]:
filtered = merged[(merged['category'] == 'Electronics') & (merged['sale_date'] > '2023-01-01')]
print(filtered)

    product_id product_name     category  sale_id  units_sold  price_per_unit  \
40    PROD1005     Somebody  Electronics     1292           5           45248
41    PROD1005     Somebody  Electronics     1379           2           59169
42    PROD1005     Somebody  Electronics     1380           8            5577
43    PROD1005     Somebody  Electronics     1531           9           61269
44    PROD1005     Somebody  Electronics     1584           9           37015
..         ...          ...          ...      ...         ...             ...
995   PROD1100      Product  Electronics     1521           9           49715
996   PROD1100      Product  Electronics     1830           2           54268
997   PROD1100      Product  Electronics     1924           1           69667
998   PROD1100      Product  Electronics     1987           6           66588
999   PROD1100      Product  Electronics     1994           5            3721

      sale_date
40   2024-08-17
41   2024-02-18
42   2024-09-13
43   2025-06-16
44   2024-04-08
..          ...
995  2023-12-03
996  2023-09-10
997  2023-08-31
998  2023-12-18
999  2024-01-10

[263 rows x 7 columns]

In [31]:
filtered.head(5)

,product_id,product_name,category,sale_id,units_sold,price_per_unit,sale_date
40,PROD1005,Somebody,Electronics,1292,5,45248,2024-08-17
41,PROD1005,Somebody,Electronics,1379,2,59169,2024-02-18
42,PROD1005,Somebody,Electronics,1380,8,5577,2024-09-13
43,PROD1005,Somebody,Electronics,1531,9,61269,2025-06-16
44,PROD1005,Somebody,Electronics,1584,9,37015,2024-04-08

In [ ]:
filtered['Total_Sales_Amount'] = filtered['units_sold']* filtered['price_per_unit']

filtered.head(5)

C:\Users\Hemanadhan\AppData\Local\Temp\ipykernel_36368\42777910.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  filtered['Total_Sales_Amount'] = filtered['units_sold']*filtered['price_per_unit']

,product_id,product_name,category,sale_id,units_sold,price_per_unit,sale_date,Total_Sales_Amount
40,PROD1005,Somebody,Electronics,1292,5,45248,2024-08-17,226240
41,PROD1005,Somebody,Electronics,1379,2,59169,2024-02-18,118338
42,PROD1005,Somebody,Electronics,1380,8,5577,2024-09-13,44616
43,PROD1005,Somebody,Electronics,1531,9,61269,2025-06-16,551421
44,PROD1005,Somebody,Electronics,1584,9,37015,2024-04-08,333135

In [33]:
total_sales_category = filtered.groupby('category')['Total_Sales_Amount'].sum()
print(total_sales_category)

category
Electronics    52456926
Name: Total_Sales_Amount, dtype: int64

In [43]:
filtered.to_csv("filtered_sales_electronics.csv", index= False)

In [35]:
filtered_merge = pd.read_csv('filtered_sales.csv')
filtered_merge.tail()

,product_id,product_name,category,sale_id,units_sold,price_per_unit,sale_date,Total_Sales_Amount
258,PROD1100,Product,Electronics,1521,9,49715,2023-12-03,447435
259,PROD1100,Product,Electronics,1830,2,54268,2023-09-10,108536
260,PROD1100,Product,Electronics,1924,1,69667,2023-08-31,69667
261,PROD1100,Product,Electronics,1987,6,66588,2023-12-18,399528
262,PROD1100,Product,Electronics,1994,5,3721,2024-01-10,18605

In [37]:
filtered_merge.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 263 entries, 0 to 262
Data columns (total 8 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   product_id          263 non-null    object
 1   product_name        263 non-null    object
 2   category            263 non-null    object
 3   sale_id             263 non-null    int64
 4   units_sold          263 non-null    int64
 5   price_per_unit      263 non-null    int64
 6   sale_date           263 non-null    object
 7   Total_Sales_Amount  263 non-null    int64
dtypes: int64(4), object(4)
memory usage: 16.6+ KB

In [38]:
merged['Total_Sales_Amount'] = merged['units_sold']* merged['price_per_unit']

merged.head(5)

,product_id,product_name,category,sale_id,units_sold,price_per_unit,sale_date,Total_Sales_Amount
0,PROD1001,The,Clothing,1030,9,36440,2024-04-18,327960
1,PROD1001,The,Clothing,1032,4,3525,2024-03-20,14100
2,PROD1001,The,Clothing,1207,8,61821,2025-01-23,494568
3,PROD1001,The,Clothing,1213,4,5257,2024-06-09,21028
4,PROD1001,The,Clothing,1262,7,65599,2024-04-01,459193

In [39]:
total_sales_category = merged.groupby('category')['Total_Sales_Amount'].sum()
print(total_sales_category)

category
Clothing       42975488
Electronics    52456926
Home           53249665
Toys           41905568
Name: Total_Sales_Amount, dtype: int64

In [42]:
merged.to_csv("filtered_sales_category.csv", index= False)

In [46]:
filtered_sales_category = pd.read_csv("filtered_sales_category.csv")
filtered_sales_category.head(3)

,product_id,product_name,category,sale_id,units_sold,price_per_unit,sale_date,Total_Sales_Amount
0,PROD1001,The,Clothing,1030,9,36440,2024-04-18,327960
1,PROD1001,The,Clothing,1032,4,3525,2024-03-20,14100
2,PROD1001,The,Clothing,1207,8,61821,2025-01-23,494568

In [47]:
filtered_sales_electronics = pd.read_csv("filtered_sales_electronics.csv")
filtered_sales_electronics.head(3)

,product_id,product_name,category,sale_id,units_sold,price_per_unit,sale_date,Total_Sales_Amount
0,PROD1005,Somebody,Electronics,1292,5,45248,2024-08-17,226240
1,PROD1005,Somebody,Electronics,1379,2,59169,2024-02-18,118338
2,PROD1005,Somebody,Electronics,1380,8,5577,2024-09-13,44616